// Составить программу вывода на экран "столбиком" пяти любых чисел веденных пользователем

Console.WriteLine("Введите первое число: ");
int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите второе число: ");
int b = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите третье число: ");
int c = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите четвертное число: ");
int d = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите пятое число: ");
int e = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Вы ввели: ");
Console.WriteLine(a);
Console.WriteLine(b);
Console.WriteLine(c);
Console.WriteLine(d);
Console.WriteLine(e);